/*********************************************************************************************************
** 程序功能 ：画出一个向上的箭头
** 程序说明 ：此程序用的是周期200us/按键，1000us/画图的频率的脉冲，8倍细分倍数。
** 晶振频率 ：12Mhz
** 注：坐标系已经修正，符合右手坐标系
*********************************************************************************************************/		 
#include<reg52.h>
#include<LCD1602.h>
#include<math.h>
#include<float.h>
#define uchar	unsigned char
#define uint	unsigned int

const float PI=3.141593;

uint Cont = 0;	 //Cont为步进电机运行的步数
bit flag = 0;	 //作为按键（0）或画图（1）的标志位，两者的最佳频率不一样	

/*********************************************************************************************************
** 按键定义及各个步进驱动器与单片机的接口定义
*********************************************************************************************************/

sbit xsr=P1^3;   //按键定义：x轴电机运动方向(后)
sbit xsl=P1^0;   //按键定义：x轴电机运动方向(前)
sbit xen=P2^0;   //定义x轴电机使能的端口
sbit xcw=P2^1;   //定义x轴电机转向的端口
sbit xcp=P2^2;   //定义控制x轴电机的脉冲端口


sbit ysr=P1^4;   //按键定义：y轴电机运动方向(左)
sbit ysl=P1^1;   //按键定义：y轴电机运动方向(右)
sbit yen=P2^3;   //定义y轴电机使能的端口
sbit ycw=P2^4;   //定义控制y轴电机转向的端口
sbit ycp=P2^5;   //定义控制y轴电机的脉冲端口


sbit zsr=P1^5;   //按键定义：z轴电机运动方向(上)
sbit zsl=P1^2;   //按键定义：z轴电机运动方向(下)
sbit zen=P2^6;	 //定义z轴电机使能的端口
sbit zcw=P2^7;	 //定义控制z轴电机转向的端口
sbit zcp=P1^7;	 //定义控制z轴电机的脉冲端口

/*********************************************************************************************************
** 函数功能 ：上电初始化
*********************************************************************************************************/
void Motor_INIT()  //步进电机初始化
{
	xen=0;
	yen=0;
	zen=0;
}
void TIM_INIT()	    		//定时器初始化
{  
   TMOD = 0x01;     		//定时器0,工作方式1 	                 	  
   PCON = 0x80;     		//SMOD=1;      								 
   TH0=0Xff;   TL0=0X9b;	//定时器0装初值
   ET0=1;                   //定时器0允许中断
   TR0=1;             		//timer 0 run  
   EA=1; 					//CPU允许中断
}
/*********************************************************************************************************
** 函数功能 ：定时器中断设置，利用定时器产生周期脉冲
*********************************************************************************************************/
void timer0 () interrupt 1 using 2
{
	if(flag)				 
		{TH0=0xfe; TL0=0x01;}		//画图周期1020us
	else
		{TH0=0xff; TL0=0x9b;} 		//按键周期200us   5K Hz
 	if (Cont!=0)					//要走的步数Cont不为0，则还没走完继续走	  
	{
		Cont--;
		if(xen==1)
		{ 
		   xcp=~xcp;				//等于1，则取反
		}
		if(yen==1)
		{ 
		   ycp=~ycp;
		}
        if(zen==1)
		{ 
		   zcp=~zcp;
		}
   	}		
}

/*********************************************************************************************************								
			3个函数：X_Move(方向，大小)，Y_Move(方向，大小)，Z_Move(方向，大小)
			   方向：1 为正，0 为负
			   大小：1 ~ 16000
*********************************************************************************************************/
void X_Move(bit direction,uint dx)
{
	xen=1;yen=0;zen=0;                       //x轴电机使能
	xcw=direction;ycw=0;zcw=0;      	 	 //x轴电机转向   修正坐标系，向右为正方向
	Cont=dx;
	while(Cont!=0);
	xcp=1;
}
void Y_Move(bit direction,uint dy)
{
	xen=0;yen=1;zen=0;                       //y轴电机使能
	xcw=0;ycw=~direction;zcw=0;      		 //y轴电机转向
	Cont=dy;
	while(Cont!=0);
	ycp=1;
}
void Z_Move(bit direction,uint dz)
{
	xen=0;yen=0;zen=1;                       //z轴电机使能
	xcw=0;ycw=0;zcw=direction;      		 //z轴电机转向
	Cont=dz;
	while(Cont!=0);
	zcp=1;
}
/********************************************************************************************************
** 函数功能 ：按键扫描
*********************************************************************************************************/
void SCAN_KEY()
{
	flag=0;
	if(xsr==0)
	{
	 X_Move(1,100);
	} 
	else if(xsl==0)
	{
	 X_Move(0,100);
	} 
	if(ysr==0)
	{
	 Y_Move(1,100);
	} 
	else if(ysl==0)
	{
	 Y_Move(0,100);
	} 
	if(zsr==0)
	{
	 Z_Move(1,100);
	} 
	else if(zsl==0)
	{												   
	 Z_Move(0,100);
	}
}

/********************************************************************************************************
** 函数功能 ：画（X，Y）向量的方向线段
*********************************************************************************************************/
void Line(int X,int Y)
{
	int t=0;
	float k=0;
	uint dx=0,dy=0;
	if(X!=0)
	{
		k=(1.0*Y)/(1.0*X);
		dx=97;
		dy=1*(abs(1*(97.0*k)));	
		for(t=0;t<abs(0.65*X);t++)				//	系数	0.65  是为了让与圆的半径符合上 
		{		
			X_Move(X>0?1:0,97);
			Y_Move(Y>0?1:0,dy);
		}
	}
	else
	{
		dy=97;
		for(t=0;t<abs(0.65*Y);t++)				//	系数	0.65  是为了让与圆的半径符合上 
		{		
			Y_Move(Y>0?1:0,dy);
		}
	}
}
/********************************************************************************************************
** 函数功能 ：书写数字0-9
*********************************************************************************************************/
void xieshu()
{
	  Line(200,0);		//写0
	  Line(0,400);
	  Line(-200,0);
	  Line(0,-400);	
	  Z_Move(0,5000);   //写0完成
	  Line(100,-100);
	  Z_Move(1,5000);
	  Line(0,-400);		 //写1
	  Z_Move(0,5000);   //写1完成
	  Line(-100,-100);
	  Z_Move(1,5000);
	  Line(200,0);		//写2
	  Line(0,-200);     
	  Line(-200,0);
	  Line(0,-200);
	  Line(200,0);
	  Z_Move(0,5000);   //写2完成
	  Line(-200,-100);
	  Z_Move(1,5000);
	  Line(200,0);	   //写3
	  Line(0,-400);	  
	  Line(-200,0);
	  Z_Move(0,5000);
	  Line(0,200);
	  Z_Move(1,5000);
	  Line(200,0);
	  Z_Move(0,5000);   //写3完成
	  Line(-200,-300);
	  Z_Move(1,5000);
	  Line(0,-200);     //写4
	  Line(200,0);
	  Line(0,200);
	  Line(0,-400);
	  Z_Move(0,5000);	//写4完成
	  Line(500,0);
	  Z_Move(1,5000);
	  Line(200,0);       //写5
	  Line(0,200);
	  Line(-200,0);
	  Line(0,200);
	  Line(200,0);
	  Z_Move(0,5000);	  //写5完成
	  Line(0,100);
	  Z_Move(1,5000);
	  Line(-200,0);       //写6
	  Line(0,400);
	  Line(0,-200);
	  Line(200,0);
	  Line(0,-200);
	  Z_Move(0,5000);	  //写6完成
	  Line(0,500);
	  Z_Move(1,5000);
	  Line(0,400);       //写7
	  Line(-200,0);
	  Z_Move(0,5000);	  //写7完成
	  Line(0,100);
	  Z_Move(1,5000);
	  Line(0,400);       //写8
	  Line(200,0);
	  Line(0,-400);
	  Line(-200,0);
	  Line(0,200);
	  Line(200,0);
	  Z_Move(0,5000);	  //写8完成
	  Line(0,300);
	  Z_Move(1,5000);
	  Line(0,400);       //写9 
	  Line(-200,0);
	  Line(0,-200);
	  Line(200,0);
	  Z_Move(0,5000);	  //写9完成
	  Line(100,0);
}
void main()
{
	TIM_INIT();		     //定时器初始化
	Motor_INIT();	     //步进电机进行初始化
	LCD_1602_Init();     //液晶显示前进行初始化
	flag=1;				 //初始化为按键适用频率
	Write_1602_String("XIESHU",0X80);
	Write_1602_String("x,y,z direction",0XC0);

    xieshu();
	while(1)
		{
			SCAN_KEY();			
		}			
}